Revit 2027 API
ParameterTypeId.RebarSystemBarTypeTopDirn1 Property
 "Top Major Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemBarTypeTopDirn1 { get; }
Public Shared ReadOnly Property RebarSystemBarTypeTopDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemBarTypeTopDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemBarTypeTopDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace